recipes/L11_wallResolved_CR/constant/momentumTransport
FoamFile { version 2.0; format ascii; class dictionary; object momentumTransport; }
simulationType  RAS;
RAS
{
    model        kOmegaSST;   // Spalart-Allmaras is the sanctioned cross-check
    turbulence      on;
    printCoeffs     on;
}
