recipes/L11_wallResolved_CR/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     foamRun;
solver          incompressibleFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4000;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      3;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;
        libs            ( "libforces.so" );
        writeControl    timeStep;
        writeInterval   5;
        log             no;
        patches         ( wing );
        rho             rhoInf;
        rhoInf          1.225;
        Aref            0.620462;
        lRef            0.393957;
        magUInf         34.0;
        liftDir         ( -0.022687323 0 0.999742610 );
        dragDir         ( 0.999742610 0 0.022687323 );
        pitchAxis       ( 0 1 0 );
        CofR            ( 1.34 0 0 );
    }
}


// ************************************************************************* //
